app/controllers/admin_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def showEdit
    @user = User.find_by(id: params[:id])

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "name", "role") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new({name: params[:user][:name], email: params[:user][:email], admin: false, password: params[:user][:password], password_confirmation: params[:user][:password_confirmation]})
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 5]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Vasya222"], ["updated_at", "2018-11-03 15:05:12.571844"], ["id", 10]]
---
  def update
    @user = User.find_by(id: params[:id])
    if params[:user][:password].blank?
      params[:user].delete(:password)
      params[:user].delete(:password_confirmation)
    end
    if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 6]]
---
  def delete
    @user = User.find_by(id: params[:id])
    @user && @user.destroy